app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.user_id = current_user.id unless current_user.admin?
    if @task.save
---
INSERT INTO `tasks` (`description`, `priority`, `expiration_date`, `user_id`, `created_at`, `updated_at`) VALUES ('aaaaaa', 1, '2015-11-24 00:00:00', 1, '2015-11-24 20:49:34', '2015-11-24 20:49:34')