app/controllers/time_sheets_controller.rb

SELECT  `time_sheets`.* FROM `time_sheets` WHERE `time_sheets`.`user_id` = 1 AND `time_sheets`.`clock_out` IS NULL  ORDER BY `time_sheets`.`id` DESC LIMIT 1
---
  def index
    @time_sheet = TimeSheet.where({user_id: current_user.id, clock_out: nil}).last

SELECT  `time_sheets`.* FROM `time_sheets` WHERE `time_sheets`.`user_id` = 1 AND `time_sheets`.`clock_out` IS NULL  ORDER BY `time_sheets`.`id` DESC LIMIT 1
INSERT INTO `time_sheets` (`clock_in`, `user_id`, `ip_address`) VALUES ('2015-11-24 09:43:00', 1, '::1')
UPDATE `time_sheets` SET `clock_out` = '2015-11-24 09:43:00', `total_minutes` = 0, `work_report` = '', `report_date` = '2015-11-24 13:43:41' WHERE `time_sheets`.`id` = 1
---
  def log
    time_sheet = TimeSheet.where({user_id: current_user.id, clock_out: nil}).last
    if time_sheet.nil?
      time_sheet = TimeSheet.new
      time_sheet.clock_in = Time.now.strftime('%Y-%m-%d %H:%M')
      time_sheet.user = current_user
    else
      time_sheet.clock_out = Time.now.strftime('%Y-%m-%d %H:%M')
      time_sheet.total_minutes = (time_sheet.clock_out - time_sheet.clock_in) / 60
      time_sheet.work_report = params[:work_report]
      time_sheet.report_date = Time.now
    end

    is_clock_in = params[:is_clock_in] == 'true'
    need_redirect = is_clock_in ? time_sheet.id? : !time_sheet.id?

    if need_redirect
      flash[:error] = is_clock_in ? t('time_sheets.errors.clock_in') : t('time_sheets.errors.clock_out')
      render nothing: true, status: :unauthorized
    else
      time_sheet.ip_address = request.remote_ip
      time_sheet.save

SELECT  `time_sheets`.* FROM `time_sheets` WHERE `time_sheets`.`id` = 1 AND `time_sheets`.`user_id` = 1  ORDER BY `time_sheets`.`id` ASC LIMIT 1
---
  def view_note
    @time_sheet = TimeSheet.where({id: params[:id], user_id: current_user.id}).first

SELECT  `time_sheets`.* FROM `time_sheets` WHERE `time_sheets`.`id` = 1 AND `time_sheets`.`user_id` = 1  ORDER BY `time_sheets`.`id` ASC LIMIT 1
---
  def edit_note
    @time_sheet = TimeSheet.where({id: params[:id], user_id: current_user.id}).first