app/controllers/users_controller.rb

  def index
    @active_users = User.where(status: 0)
---
SELECT `users`.* FROM `users` WHERE `users`.`status` = 0

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`username`, `password_digest`, `timezone`, `first_name`, `last_name`, `email`, `phone_number`, `title`, `created_at`, `updated_at`) VALUES ('empleado1', '$2a$10$RezKpBJy.ACOSr9W1MwpXOaBnJc68EtG8kmHa6nEItgKQRdLRjKX.', 'American Samoa', 'Pedro', 'Juan', 'pedro@gmail.com', '', '', '2015-11-24 20:47:41', '2015-11-24 20:47:41')